package itis.ecozubrbot.constants;

import lombok.AllArgsConstructor;
import lombok.Getter;

@AllArgsConstructor
@Getter
public enum StringConstants {
    UNKNOWN_COMMAND_ANSWER("😢 Прости, я не знаю такой команды :("),
    HELP("""
            🦬 ЭкоЗубр — чат-бот с виртуальным зверьком, который помогает находить эко-мероприятия, \
            выполнять задания и получать за это реальные награды, делая экологию увлекательной игрой.
            
            Доступные команды:
            /menu — главное меню
            /help — справка"""),
    START("\uD83C\uDFAF Основное меню. Выбери действие: "),
    START_BOT_UPDATE("""
            Привет! Я ЭкоЗубр - твой друг в мире экологии.
            
            Со мной ты сможешь:
            • ⭐ Участвовать в эко-событиях и выполнять задания
            • \uD83D\uDCDA Узнавать интересные факты об экологии
            • \uD83C\uDF81 Обменивать баллы на купоны и мерч
            • \uD83E\uDDAC Вырастить своего ЭкоЗубра
            
            Для начала, отправь свою геолокацию, чтобы мы предлагали события в твоём городе:"""),
    PET_BUTTON("\uD83E\uDDAC Зверёк"), // 🦬
    ERROR("😨 Произошла непредвиденная ошибка"),
    TASKS_BUTTON("✅ Задания"),
    EVENTS_BUTTON("\uD83D\uDCC5 События"), // 📅
    SHOP_BUTTON("\uD83D\uDED2 Магазин"), // 🛒
    BACK_BUTTON("🔙 Назад"),
    PROFILE_BUTTON("\uD83D\uDC64 Профиль"), // 👤
    CHANGE_CITY_BUTTON("\uD83D\uDCCD Сменить город"), // 📍
    CHANGE_CITY_INFO("Чтобы сменить город отправь свою геолокацию"),
    LEADERBOARD_BUTTON("\uD83C\uDFC6 Рейтинг"), // 🏆
    GEOLOCATION_BUTTON("\uD83D\uDCCD Геолокация"), // 📍
    GEOLOCATION_UPDATE_SUCCESS("Геолокация успешно задана!"),
    GEOLOCATION_UPDATE_FAIL("❌ Не удалось обновить геолокацию, попробуйте снова"),
    USER_NOT_FOUND("❌ Мы не смогли определить вас. Скорее всего, вы не прошли процесс регистрации"),
    PET_START_MESSAGE("Это твой виртуальный зверёк!\n\nОпыт: %s\nСовет: Каждый день ухаживай за питомцем, чтобы он не загрустил!"),
    CARESS_BUTTON("💕 Приласкать"),
    CARESS_ANSWER("\uD83E\uDD7A\uD83D\uDC9E..."),
    FORWARD_LIST_BUTTON(">"),
    BACKWARD_LIST_BUTTON("<"),
    VOID("⠀"),
    CHALLENGES("✅ Доступные задания:"),
    EVENTS("\uD83D\uDCC5 События в твоём городе:"), // 📅
    SHOP("Магазин"),
    REWARD_PURCHASE_BUTTON(" Обменять"),
    BACK_TO_SHOP("🔙 Вернуться в магазин"),
    SUCCESS_PURCHASE("🎉 Успешный обмен! Ваша награда:\n%s"),
    REWARD_SOLD_OUT("😭 Данная награда закончилась, выберите другую :("),
    NOT_ENOUGH_POINTS("❌ У вас недостаточно баллов для обмена на эту награду, выберите другую"),
    CHALLENGE_DONE_BUTTON("😎 Задание выполнено!"),
    EVENT_DONE_BUTTON("😎 Я там был!"),
    BACK_TO_MENU_BUTTON("🔙 Вернуться в меню"),
    ADD_CONTENT_INFO("Отправь корректный json текст для добавления контента и прикрепи картинку"),
    ADD_CONTENT_SUCCESS("🎉 Успешно добавлено"),
    ADD_CONTENT_FAIL("😔 Не удалось добавить, попробуйте ещё раз"),
    SEND_PHOTO_AND_TEXT("🤨 Вы должны прислать фото И текст"),
    ACCEPT_PROOF_FOR_SENDING("👍 Подтвердить"),
    EDIT_PROOF_FOR_SENDING("✍️ Исправить"),
    PROOF_GET_SUCCESS("🤠 Ваши доказательства приняты!"),
    PROOF_CHECK(
            "Текст вашего доказательства:\n%s\n\nКартинка вашего доказательства прикреплена к данному сообщению. Подтвердите отправку доказательства на проверку"),
    WAITING_OF_PROOFS("Пришлите доказательство выполнения задания/участия в виде картинки с текстом"),
    LEADERBOARD_LIST_INFO("\uD83C\uDFC6 Рейтинг"), // 🏆
    LEADERBOARD_1_PLACE("\uD83E\uDD47 место: %s (%d XP)"), // 🥇
    LEADERBOARD_2_PLACE("\uD83E\uDD48 место: %s (%d XP)"),
    LEADERBOARD_3_PLACE("\uD83E\uDD49 место: %s (%d XP)"),
    LEADERBOARD_4_PLACE("4️⃣ место: %s (%d XP)"),
    LEADERBOARD_5_PLACE("5️⃣ место: %s (%d XP)"),
    LEADERBOARD_YOUR_PLACE("⭐ %d место: %s (%d XP)"),
    PROFILE_INFO(
            """
            👤 Мой профиль
            - Имя: %s
            - Город: %s
            - Дата регистрации: %s


            📊 Статистика
            - Баллы: %d
            - Опыт: %d
            - Выполнено заданий: %d
            - Посещено событий: %d
            - Решено квизов: %d"""),
    TASK_DETAILS_TEMPLATE("%s\n\n%s\n\n\uD83C\uDF81 Награда\n\uD83D\uDCB0 Баллы: %s\n⭐ Опыт: %s");
    private final String value;
}
