package itis.ecozubrbot.constants;

import lombok.AllArgsConstructor;
import lombok.Getter;

@AllArgsConstructor
@Getter
public enum StringConstants {
    UNKNOWN_COMMAND_ANSWER("Прости, я не знаю такой команды :("),
    HELP("Тут сообщение со справкой по использованию бота"),
    START("Привет! Это бот эко-зубр. У нас ты можешь: "),
    START_BOT_UPDATE("Привет! Это бот эко-зубр. \n\nДля продолжения регистрации нам нужно узнать твой город"),
    PET_BUTTON("Зверёк"),
    TASKS_BUTTON("Задания"),
    EVENTS_BUTTON("События"),
    SHOP_BUTTON("Магазин"),
    BACK_BUTTON("Назад"),
    PROFILE_BUTTON("Профиль"),
    LEADERBOARD_BUTTON("Рейтинг"),
    GEOLOCATION_BUTTON("Геолокация"),
    GEOLOCATION_UPDATE_SUCCESS("Геолокация успешно задана!"),
    GEOLOCATION_UPDATE_FAIL("Не удалось обновить геолокацию, попробуйте снова"),
    USER_NOT_FOUND("Мы не смогли определить вас. Скорее всего, вы не прошли процесс регистрации"),
    PET_START_MESSAGE("Это твой виртуальный зверёк!\n\nОпыт: %s"),
    CARESS_BUTTON("Приласкать"),
    CARESS_ANSWER("\uD83E\uDD7A\uD83D\uDC9E..."),
    FORWARD_LIST_BUTTON(">"),
    BACKWARD_LIST_BUTTON("<"),
    VOID("⠀"),
    CHALLENGE_DONE_BUTTON("Челлендж выполнен!"),
    BACK_TO_MENU_BUTTON("Вернуться в меню"),
    ADD_CONTENT_INFO("Отправь корректный json текст для добавления челленджа/события/награды и прикрепи картинку"),
    ADD_CONTENT_SUCCESS("Успешно добавлено"),
    ADD_CONTENT_FAIL("Не удалось добавить, попробуйте ещё раз"),
    SEND_PHOTO_AND_TEXT("Вы должны прислать фото И текст"),
    ACCEPT_PROOF_FOR_SENDING("Подтвердить"),
    EDIT_PROOF_FOR_SENDING("Исправить"),
    PROOF_CHECK(
            "Текст вашего доказательства:\n%s\n\nКартинка вашего доказательства прикреплена к данному сообщению. Подтвердите отправку доказательства на проверку"),
    WAITING_OF_PROOFS("Пришлите доказательство выполнения задания/участия в виде картинки с текстом");
    LEADERBOARD_LIST_INFO("\uD83C\uDFC6 Рейтинг"), // 🏆
    LEADERBOARD_1_PLACE("\uD83E\uDD47 место: %s (%d XP)"), // 🥇
    LEADERBOARD_2_PLACE("\uD83E\uDD48 место: %s (%d XP)"),
    LEADERBOARD_3_PLACE("\uD83E\uDD49 место: %s (%d XP)"),
    LEADERBOARD_4_PLACE("4️⃣ место: %s (%d XP)"),
    LEADERBOARD_5_PLACE("5️⃣ место: %s (%d XP)"),
    LEADERBOARD_YOUR_PLACE("⭐ %d место: %s (%d XP)");
    private final String value;
}
