package itis.ecozubrbot.constants;

import lombok.AllArgsConstructor;
import lombok.Getter;

@AllArgsConstructor
@Getter
public enum StringConstants {
    UNKNOWN_COMMAND_ANSWER("Прости, я не знаю такой команды :("),
    HELP("Тут сообщение со справкой по использованию бота"),
    START("Привет! Это бот эко-зубр. У нас ты можешь: "),
    START_BOT_UPDATE("Привет, [имя пользователя]! Я ЭкоЗубр - твой друг в мире экологии.\n" +
            "\n" +
            "Со мной ты сможешь:\n" +
            "⭐ Участвовать в экособытиях и выполнять челленджи\n" +
            "\uD83D\uDCDA Узнавать интересные факты об экологии\n" +
            "\uD83C\uDF81 Обменивать баллы на купоны и мерч\n" +
            "\uD83E\uDDAC Вырастить своего ЭкоЗубра\n" +
            "\n" +
            "Для начала, отправь свою геолокацию, чтобы мы предлагали события в твоём городе:"),
    PET_BUTTON("Зверёк"),
    ERROR("Произошла непредвиденная ошибка"),
    TASKS_BUTTON("Задания"),
    EVENTS_BUTTON("События"),
    SHOP_BUTTON("Магазин"),
    BACK_BUTTON("Назад"),
    PROFILE_BUTTON("Профиль"),
    CHANGE_CITY_BUTTON("Сменить город"),
    CHANGE_CITY_INFO("Чтобы сменить город отправь свою геолокацию"),
    LEADERBOARD_BUTTON("Рейтинг"),
    GEOLOCATION_BUTTON("Геолокация"),
    GEOLOCATION_UPDATE_SUCCESS("Геолокация успешно задана!"),
    GEOLOCATION_UPDATE_FAIL("Не удалось обновить геолокацию, попробуйте снова"),
    USER_NOT_FOUND("Мы не смогли определить вас. Скорее всего, вы не прошли процесс регистрации"),
    PET_START_MESSAGE("Это твой виртуальный зверёк!\n\nОпыт: %s"),
    CARESS_BUTTON("Приласкать"),
    CARESS_ANSWER("\uD83E\uDD7A\uD83D\uDC9E..."),
    FORWARD_LIST_BUTTON(">"),
    BACKWARD_LIST_BUTTON("<"),
    VOID("⠀"),
    CHALLENGES("Здесь раздел с заданиями"),
    EVENTS("Здесь раздел с событиями"),
    SHOP("Магазин"),
    REWARD_PURCHASE_BUTTON("Обменять"),
    BACK_TO_SHOP("Вернуться в магазин"),
    SUCCESS_PURCHASE("Успешный обмен! Ваша награда:\n%s"),
    REWARD_SOLD_OUT("Данная награда закончилась, выберите другую :("),
    NOT_ENOUGH_POINTS("У вас недостаточно очков для обмена на эту награду, выберите другую"),
    CHALLENGE_DONE_BUTTON("Челлендж выполнен!"),
    EVENT_DONE_BUTTON("Я там был!"),
    BACK_TO_MENU_BUTTON("Вернуться в меню"),
    ADD_CONTENT_INFO("Отправь корректный json текст для добавления челленджа/события/награды и прикрепи картинку"),
    ADD_CONTENT_SUCCESS("Успешно добавлено"),
    ADD_CONTENT_FAIL("Не удалось добавить, попробуйте ещё раз"),
    SEND_PHOTO_AND_TEXT("Вы должны прислать фото И текст"),
    ACCEPT_PROOF_FOR_SENDING("Подтвердить"),
    EDIT_PROOF_FOR_SENDING("Исправить"),
    PROOF_GET_SUCCESS("Ваши доказательства приняты!"),
    PROOF_CHECK(
            "Текст вашего доказательства:\n%s\n\nКартинка вашего доказательства прикреплена к данному сообщению. Подтвердите отправку доказательства на проверку"),
    WAITING_OF_PROOFS("Пришлите доказательство выполнения задания/участия в виде картинки с текстом"),
    LEADERBOARD_LIST_INFO("\uD83C\uDFC6 Рейтинг"), // 🏆
    LEADERBOARD_1_PLACE("\uD83E\uDD47 место: %s (%d XP)"), // 🥇
    LEADERBOARD_2_PLACE("\uD83E\uDD48 место: %s (%d XP)"),
    LEADERBOARD_3_PLACE("\uD83E\uDD49 место: %s (%d XP)"),
    LEADERBOARD_4_PLACE("4️⃣ место: %s (%d XP)"),
    LEADERBOARD_5_PLACE("5️⃣ место: %s (%d XP)"),
    LEADERBOARD_YOUR_PLACE("⭐ %d место: %s (%d XP)"),
    PROFILE_INFO(
            """
            👤 Мой профиль

            ┌─ Основная информация
            ├─ Имя: %s
            ├─ Город: %s
            ├─ Дата создания: %s


            📊 Статистика
            ├─ Баллы: %d
            ├─ Опыт: %d
            ├─ Выполнено челленджей: %d
            ├─ Посещено событий: %d
            ├─ Решено квизов: %d""");

    private final String value;
}
